In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Multiple WHERE clauses
### Exercises
You've learned about semi joins in the form of nested subqueries within the WHERE clause of the main query. In this exercise, you'll familiarize yourself with semi join syntax by thinking through and re-ordering the lines of code provided. Note that subqueries are queries in their own right, so they can have a WHERE clause of their own! This is why you see two WHERE statements here.

Your task is to construct a semi join that pulls all records from economies2019 where gross_savings in the economies2015 table were below the 2015 global average. The global average gross_savings in 2015 was 22.5, and is already pre-calculated in the lines of code provided.

### Instruction
Re-order the lines of code provided to find all records from economies2019 where gross_savings in economies2015 were below the 2015 global average, using code to filter the economies2019 records.

### Drage the items below into order
- SELECT *
- WHERE code in
- WHERE gross_savings < 22.5)
- FROM economies2019
- (SELECT code
- FROM economies2015

Answer:
- SELECT *
- FROM economies2019
- WHERE code in
- (SELECT code
- FROM economies2015
- WHERE gross_savings < 22.5)

# 2. Semi join
### Exercises
Great job getting acquainted with semi joins and anti joins! You are now going to practice using semi joins.

Let's say you are interested in identifying languages spoken in the Middle East. The languages table contains information about languages and countries, but it does not tell you what region the countries belong to. You can build up a semi join by filtering the countries table by a particular region, and then using this to further filter the languages table.

You'll build up your semi join as you did in the video exercise, block by block, starting with a selection of countries from the countries table, and then leveraging a WHERE clause to filter the languages table by this selection.

### task 1
### Instruction
Select country code as a single field from the countries table, filtering for countries in the 'Middle East' region.

In [4]:
%%sql

-- Select country code for countries in the Middle East
SELECT code
FROM countries
WHERE region = 'Middle East'
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('ARE',), ('ARM',), ('AZE',)]

### task 2
### Instructiom
- Write a second query to SELECT the name of each unique language appearing in the languages table; do not use column aliases here.
- Order the result set by name in ascending order.

In [6]:
%%sql

-- Select unique language names
SELECT DISTINCT(name)
FROM languages
-- Order by the name of the language
ORDER BY name
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Afar',), ('Afrikaans',), ('Akyem',)]

### task 3
### Instruction
Create a semi join out of the two queries you've written, which filters unique languages returned in the first query for only those languages spoken in the 'Middle East'.

In [7]:
%%sql

SELECT DISTINCT name
FROM languages
-- Add syntax to use bracketed subquery below as a filter
WHERE code IN
    (SELECT code
    FROM countries
    WHERE region = 'Middle East')
ORDER BY name
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Arabic',), ('Aramaic',), ('Armenian',)]

# 3. Diagnosing problems using anti join
### Exercises
Nice work on semi joins! The anti join is a related and powerful joining tool. It can be particularly useful for identifying whether an incorrect number of records appears in a join.

Say we are interested in identifying currencies of Oceanian countries. We have the following INNER JOIN which returns 15 records, and want to check that all Oceanian countries in our countries table are included in this result. If not, we want to return the names of any excluded countries.

SELECT c1.code, name, basic_unit AS currency\
FROM countries AS c1\
INNER JOIN currencies AS c2\
ON c1.code = c2.code\
WHERE c1.continent = 'Oceania';

An anti join will give us the names of these countries, if any! Your task is to write this anti join.

### task 1
### Instruction
- Begin your anti join by returning the code and name (in order, not aliased) for all countries in the continent of Oceania from the countries table.
- Observe the number of records returned and compare this with the provided INNER JOIN, which returns 15 records.

In [8]:
%%sql

-- Select code and name of countries from Oceania
SELECT code, name
FROM countries
WHERE continent LIKE 'Oceania'
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('ASM', 'American Samoa'), ('AUS', 'Australia'), ('FJI', 'Fiji Islands')]

### task 2
### Instruction
Complete your anti join by adding an additional filter to return every country code that is not included in the currencies table.

In [9]:
%%sql

SELECT code, name
FROM countries
WHERE continent = 'Oceania'
-- Filter for countries not included in the bracketed subquery
  AND code NOT IN
    (SELECT code
    FROM currencies);

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[('ASM', 'American Samoa'),
 ('FJI', 'Fiji Islands'),
 ('GUM', 'Guam'),
 ('FSM', 'Micronesia, Federated States of'),
 ('MNP', 'Northern Mariana Islands')]

# 4. Subquery inside WHERE
### Exercises
The video exercise pointed out that subqueries inside WHERE can either be from the same table or a different table. In this exercise, you will nest a subquery from the populations table inside another query, also from the populations table. Your goal is to figure out which countries had high average life expectancies in 2015.

You can use SQL to do calculations for you. Suppose you only want records from 2015 with life_expectancy above 1.15 * avg_life_expectancy. You could use the following SQL query:

SELECT *\
FROM populations\
WHERE life_expectancy > 1.15 * avg_life_expectancy\
  AND year = 2015;

### task 1
### Instruction
- Begin by calculating the average life expectancy from the populations table.
- Filter your data to return records from 2015 only.

In [10]:
%%sql

-- Select average life_expectancy from the populations table
SELECT AVG(life_expectancy)
FROM populations
-- Filter for the year 2015
WHERE year = 2015;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(71.6763415481105,)]

### task 2
### Instruction
Filter for only those populations where life_expectancy is 1.15 times higher than average.

In [11]:
%%sql

SELECT *
FROM populations
-- Filter for only those populations where life expectancy is 1.15 times higher than average
WHERE life_expectancy > 1.15 *
  (SELECT AVG(life_expectancy)
   FROM populations
   WHERE year = 2015) 
     AND year = 2015;

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(21, 'AUS', 2015, 1.833, 82.45122, 23789752.0),
 (376, 'CHE', 2015, 1.54, 83.19756, 8281430.0),
 (356, 'ESP', 2015, 1.32, 83.380486, 46443992.0),
 (134, 'FRA', 2015, 2.01, 82.67073, 66538392.0),
 (170, 'HKG', 2015, 1.195, 84.278046, 7305700.0),
 (174, 'ISL', 2015, 1.93, 82.86098, 330815.0),
 (190, 'ITA', 2015, 1.37, 83.49024, 60730584.0),
 (194, 'JPN', 2015, 1.46, 83.84366, 126958470.0),
 (340, 'SGP', 2015, 1.24, 82.59512, 5535002.0),
 (374, 'SWE', 2015, 1.88, 82.551216, 9799186.0)]

# 5. WHERE do people live?
### Exercises
In this exercise, you will strengthen your knowledge of subquerying using WHERE. Follow the instructions below to get the urban area population for capital cities only. Explore the tables displayed in the console to help identify columns of interest as you build your query.

### Instruction
Return the name, country_code and urbanarea_pop for all capital cities (not aliased).

In [12]:
%%sql

SELECT name, country_code, urbanarea_pop
FROM cities
-- Filter using a subquery on the countries table
WHERE name IN
  (SELECT capital
   FROM countries)
ORDER BY urbanarea_pop DESC
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Beijing', 'CHN', 21516000),
 ('Dhaka', 'BGD', 14543124),
 ('Tokyo', 'JPN', 13513734)]

# 6. Subquery inside SELECT
### Exercises
As explored in the video, there are often multiple ways to produce the same result in SQL. You saw that subqueries can provide an alternative to joins to obtain the same result.

In this exercise, you'll go further in exploring how some queries can be written using either a join or a subquery.

In Step 1, you'll begin with a LEFT JOIN combined with a GROUP BY to obtain summarized information from two tables in order to select the nine countries with the most cities appearing in the cities table. In Step 2, you'll write a query that returns the same result as the join, but leveraging a nested query instead.

### task 1
### Instruction
- Write a LEFT JOIN on the countries and cities tables to select names of countries in cities (aliasing country name as country), followed by counts of cities as cities_num.
- Sort by cities_num (descending) and limit to the first nine records.

In [13]:
%%sql

-- Find top nine countries with the most cities
SELECT countries.name AS country, COUNT(*) AS cities_num
FROM countries
LEFT JOIN cities
ON countries.code = cities.country_code
GROUP BY country
-- Order by count of cities as cities_num
ORDER BY cities_num DESC, country
LIMIT 9;

 * postgresql://postgres:***@localhost:2828/datacamp
9 rows affected.

[('China', 36),
 ('India', 18),
 ('Japan', 11),
 ('Brazil', 10),
 ('Pakistan', 9),
 ('United States', 9),
 ('Indonesia', 7),
 ('Russian Federation', 7),
 ('South Korea', 7)]

### task 2
### Instruction
Write a nested subquery that returns an equivalent result to your LEFT JOIN, finding the counts of cities appearing in the cities table as cities_num.

In [15]:
%%sql

SELECT countries.name AS country,
-- Subquery that provides the count of cities 
  (SELECT COUNT(*) FROM cities WHERE countries.code=cities.country_code) AS cities_num
FROM countries
ORDER BY cities_num DESC, country
LIMIT 9;

 * postgresql://postgres:***@localhost:2828/datacamp
9 rows affected.

[('China', 36),
 ('India', 18),
 ('Japan', 11),
 ('Brazil', 10),
 ('Pakistan', 9),
 ('United States', 9),
 ('Indonesia', 7),
 ('Russian Federation', 7),
 ('South Korea', 7)]

# 7. Subquery inside FROM
### Exercises
Subqueries inside FROM can help us select columns from multiple tables in a single query.

Say you are interested in determining the number of languages spoken for each country. You want to present this information alongside each country's local_name, which is a field only present in the countries table and not in the languages table. You'll use a subquery inside FROM to bring information from these two tables together!

### task 1
### Instruction
Begin with a query that returns country code from languages, and a count of languages spoken in each country as lang_num.

In [16]:
%%sql

-- Select code, and language count as lang_num
SELECT code, COUNT(*) AS lang_num
FROM languages
GROUP BY code
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('PRY', 2), ('NRU', 3), ('MDG', 3)]

### task 2
### Instruction
- Select local_name from countries, with the aliased lang_num from your subquery (which has been nested and aliased for you as sub).
- Use WHERE to match the code field from countries and sub.

In [17]:
%%sql

-- Select local_name and lang_num from appropriate tables
SELECT local_name, sub.lang_num
FROM countries,
    (SELECT code, COUNT(*) AS lang_num
     FROM languages
     GROUP BY code) AS sub
-- Where codes match    
WHERE countries.code = sub.code
ORDER BY lang_num DESC
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Zambia', 19), ('YeItyop´iya', 16), ('Zimbabwe', 16)]

# 8. Subquery challenge
### Exercises
You're near the finish line! Test your understanding of subquerying with a challenge problem.

Suppose you're interested in analyzing inflation and unemployment rate for certain countries in 2015. You are not interested in countries with "Republic" or "Monarchy" as their form of government, but are interested in all other forms of government, such as emirate federations, socialist states, and commonwealths.

You will use the field gov_form to filter for these two conditions, which represents a country's form of government. You can review the different entries for gov_form in the countries table.

### task 1
### Instruction
- Select country code, inflation_rate, and unemployment_rate from economies.
- Filter code for the set of countries which do not contain the words "Republic" or "Monarchy" in their gov_form.

In [20]:
%%sql

-- Select relevant fields
SELECT code, inflation_rate, unemployment_rate
FROM economies
WHERE year = 2015 
  AND code NOT IN
-- Subquery returning country codes filtered on gov_form
    (SELECT code
     FROM countries
     WHERE (gov_form LIKE '%Monarchy%' OR gov_form LIKE '%Republic%'))
ORDER BY inflation_rate;

 * postgresql://postgres:***@localhost:2828/datacamp
12 rows affected.

[('AFG', -1.549, None),
 ('CHE', -1.14, 3.178),
 ('PRI', -0.751, 12.0),
 ('ROU', -0.596, 6.812),
 ('TLS', 0.553, None),
 ('MNE', 1.204, None),
 ('SRB', 1.392, 18.2),
 ('HKG', 3.037, 3.296),
 ('ARE', 4.07, None),
 ('MAC', 4.564, 1.825),
 ('LBY', 9.839, None),
 ('SSD', 52.813, None)]

# 9. Final challenge
### Exercises
You've made it to the final challenge problem! Get ready to tackle this step-by-step.

Your task is to determine the top 10 capital cities in Europe and the Americas by city_perc, a metric you'll calculate. city_perc is a percentage that calculates the "proper" population in a city as a percentage of the total population in the wider metro area, as follows:

city_proper_pop / metroarea_pop * 100

Do not use table aliasing in this exercise.

### Instruction
- From cities, select the city name, country code, proper population, and metro area population, as well as the field city_perc, which calculates the proper population as a percentage of metro area population for each city (using the formula provided).
- Filter city name with a subquery that selects capital cities from countries in 'Europe' or continents with 'America' at the end of their name.
- Exclude NULL values in metroarea_pop.
- Order by city_perc (descending) and return only the first 10 rows.

In [21]:
%%sql

-- Select fields from cities
SELECT 
	name, 
    country_code, 
    city_proper_pop, 
    metroarea_pop,
    city_proper_pop / metroarea_pop * 100 AS city_perc
FROM cities
-- Use subquery to filter city name
WHERE name IN
  (SELECT capital
   FROM countries
   WHERE (continent = 'Europe'
   OR continent LIKE '%America'))
-- Add filter condition such that metroarea_pop does not have null values
	  AND metroarea_pop IS NOT NULL
-- Sort and limit the result
ORDER BY city_perc DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Berlin', 'DEU', 3517424, 5871022, 0),
 ('Bogota', 'COL', 7878783, 9800000, 0),
 ('Brasilia', 'BRA', 2556149, 3919864, 0),
 ('Budapest', 'HUN', 1759407, 2927944, 0),
 ('Buenos Aires', 'ARG', 3054300, 14122000, 0),
 ('Caracas', 'VEN', 1943901, 2923959, 0),
 ('Guatemala City', 'GTM', 2110100, 4500000, 0),
 ('Lima', 'PER', 8852000, 10750000, 0),
 ('London', 'GBR', 8673713, 13879757, 0),
 ('Mexico City', 'MEX', 8974724, 20063000, 0)]